Tekla.Structures.Model.SurfaceTreatment
The SurfaceTreatment class defines a layer above a building element defining what a surface looks like.
The surface could for example have a tiled look.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
ContourPlate cp = new ContourPlate();
cp.Profile.ProfileString = "PL10";
cp.Class = "3";
cp.AddContourPoint(new ContourPoint(new Point( 6000,  6000,0),null));
cp.AddContourPoint(new ContourPoint(new Point( 9000,  6000,0),null));
cp.AddContourPoint(new ContourPoint(new Point( 9000, 12000,0),null));
cp.AddContourPoint(new ContourPoint(new Point(10500, 15000,0),null));
cp.AddContourPoint(new ContourPoint(new Point( 6000, 12000,0),null));
Contour c = new Contour();
c.AddContourPoint(new ContourPoint(new Point( 6000,  6000,5), null));
c.AddContourPoint(new ContourPoint(new Point( 9000,  6000,5), null));
c.AddContourPoint(new ContourPoint(new Point( 9000, 12000,5), null));
c.AddContourPoint(new ContourPoint(new Point(10500, 15000,5), null));
c.AddContourPoint(new ContourPoint(new Point( 7500, 12000,5), null));
cp.Insert();
SurfaceTreatment treatment = new SurfaceTreatment();
treatment.Father = cp;
treatment.Polygon = c;
treatment.StartPoint = new Point(1500,0000,0);
treatment.EndPoint = new Point(1500,6000,0);
bool Result = false;
Result = treatment.Insert();
}
}

Tekla.Structures.Model.SurfaceTreatment.Type
The type of the surfacing.

Tekla.Structures.Model.SurfaceTreatment.Color
The color of the surfacing.

Tekla.Structures.Model.SurfaceTreatment.Material
Defines the material for the surface treatment.

Tekla.Structures.Model.SurfaceTreatment.Position
Defines the position for the surface treatment.

Tekla.Structures.Model.SurfaceTreatment.Polygon
Defines the area for the surface treatment.

Tekla.Structures.Model.SurfaceTreatment.StartPoint
Determines the origin of the surfacing. The surfacing is then filled out from
the start point towards the end point.

Tekla.Structures.Model.SurfaceTreatment.EndPoint
Determines the direction the surfacing is filled in. The direction is from the start point
towards the end point.

Tekla.Structures.Model.SurfaceTreatment.Father
Defines the father part for the surface treatment: the part that the surface treatment is created on.

Tekla.Structures.Model.SurfaceTreatment.Thickness
Defines how thick the surface treatment is.

Tekla.Structures.Model.SurfaceTreatment.Name
The name of the surface treatment.

Tekla.Structures.Model.SurfaceTreatment.Class
The class of the surface treatment.

Tekla.Structures.Model.SurfaceTreatment.CutByFatherBooleans
Defines if the part is cut by the father's cuts.
Remarks: Polygon cuts are not supported.

Tekla.Structures.Model.SurfaceTreatment.TypeName
The name of the surface treatment type. The valid names are defined in the product_finishes.dat file.

Tekla.Structures.Model.SurfaceTreatment.#ctor
Creates a new surface treatment instance.

Tekla.Structures.Model.SurfaceTreatment.Insert
Inserts the surface treatment to the database.
Returns: True on success.

Tekla.Structures.Model.SurfaceTreatment.Select
Selects the surface treatment with the given identifier.
Returns: True on success.

Tekla.Structures.Model.SurfaceTreatment.Modify
Modifies the surface treatment with the given identifier in the database to match
the current one.
Returns: True on success.

Tekla.Structures.Model.SurfaceTreatment.Delete
Deletes the surface treatment with the given identifier from the database.
Returns: True on success.